export const learningMethods = [
  {
    title: "분야별 전문가가 설계부터 전달까지 참여",
    description:
      "BE, FE, Mobile, DB와 Cloud 분야별 교육 전문가가 교육 과정을 직접 설계하고 전달까지 참여합니다. 단지 수업 자료를 만드는 것 뿐만 아니라 학습 목표에 필요한 지식과 지식을 활용하는 경험, 그리고 더 체계화하는 학습 활동까지 종합적으로 설계합니다. 수업 중에도 설계한 전문가 의도에 맞는 맞춤형 피드백을 제공할 수 있습니다 ",
  },
  {
    title: "PBL 미션 중심으로 학습",
    description:
      "눈으로 보는 강의식 수업만으로는 학습은 부족합니다. 직접 시도해보고 실수도 해보고 잘못된 부분을 추측도 해보고 개선해보고 해결하면서 성장해야 합니다. 설계할 때 학습해야 하는 지식과 경험이 필요한 PBL 미션을 준비합니다. 미리 해결해보면서 난이도와 계단식 성장 단계를 배치합니다. ",
  },
  {
    title: "근거기반 교육공학으로 활동을 설계",
    description:
      "PBL 미션을 해결하는 동안 생각들, 고민들, 시도와 실수를 설명할 수 있고 스스로를 돌아보며 성장할 수 있도록 메타인지를 느낄 수 있는 교육 활동이 필요합니다. PBL 미션을 완성하는 게 학습 목표가 아니고 학습하는 과정 전체를 경험하는 게 학습 목표여야 합니다. 동료들과 함께 학습하기 위한 지식 + 미션 + 활동은 근거기반 교육공학을 기초로 설계합니다 ",
  },
  {
    title: "CS부터 분야별 지식, AI 활용까지",
    description:
      "학습할 지식은 CS 기초부터 분야별 지식과 AI 활용까지 수직적이고 종합적입니다. 파편적으로 편식하지 않도록 계속해서 시야를 넓혀가면서 결합하도록 배치하고 강조합니다. AI를 활용하는 학습도 마찬가지입니다. 지식은 기존에 학습한 지식과 연결되어야 더 단단해지고 구조화됩니다",
  },
];
